In [1]:
### Python wit SQLite

import sqlite3

print(sqlite3.version)
print(sqlite3.sqlite_version)

2.6.0
3.31.1

In [2]:
db = sqlite3.connect(':memory:')

In [3]:
cursor = db.cursor()

In [4]:
cursor.execute('''CREATE TABLE books(id INTEGER PRIMARY KEY, 
                   title TEXT, author TEXT, price TEXT, year TEXT)
''')
db.commit()

In [5]:
cursor.execute('''INSERT INTO books values (1, 'Pro PowerShell', 'Bryan Cafferky', 35.00, 2015)''')

In [6]:
cursor.execute('''INSERT INTO books values (2, "'Hithiker's Guide to the Galaxy", 'Douglas Adams', 12.00, 199)
''')
db.commit()

In [7]:
lstbooks = cursor.execute('''select * from books;''').fetchall()
db.commit()
print(lstbooks)

[(1, 'Pro PowerShell', 'Bryan Cafferky', '35.0', '2015'), (2, "'Hithiker's Guide to the Galaxy", 'Douglas Adams', '12.0', '199')]

In [8]:
type(lstbooks)

list

In [9]:
import sqlite3
import pandas as pd

# convert query results to a dataframe
dfbook = pd.read_sql_query("SELECT * FROM books", db)
dfbook.head()

   id                            title          author price  year
0   1                   Pro PowerShell  Bryan Cafferky  35.0  2015
1   2  'Hithiker's Guide to the Galaxy   Douglas Adams  12.0   199

In [10]:
cursor = db.cursor()
cursor.execute('''DROP TABLE books''')
db.commit()

In [11]:
booksdf = cursor.execute('''select * from books;''').fetchall()
db.commit()

OperationalError: no such table: books

In [13]:
### new cases (chinook)

In [14]:
conn = sqlite3.connect("chinook.db")
cur = conn.cursor()

In [15]:
albums = cur.execute("""select * from albums order by title limit 3;""").fetchall()
print(albums)

[(156, '...And Justice For All', 50), (257, '20th Century Masters - The Millennium Collection: The Best of Scorpions', 179), (296, 'A Copland Celebration, Vol. I', 230)]

In [16]:
type(albums)

list

In [17]:
import sqlite3
import pandas as pd

# convert query results to a dataframe

dfalbum = pd.read_sql_query("SELECT * FROM albums", conn)
dfalbum.head()

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

In [22]:
dftablist = pd.read_sql_query("select name from sqlite_master where type = 'table';", conn)

In [27]:
qry = '''
select substr(a.name, 1, 10) as Artist,
       substr(title,1, 15) as Album,
       t.name as Song
from albums r
join artists a
on (r.artistid = a.artistid)
join tracks t 
on (r.albumid = t.albumid)
order by a.name, title
limit 15;
'''

pd.read_sql_query(qry, conn, index_col = 'Artist')  # index_col replaces the default dataframe index

                  Album                                     Song
Artist
AC/DC   For Those About  For Those About To Rock (We Salute You)
AC/DC   For Those About                    Put The Finger On You
AC/DC   For Those About                          Let's Get It Up
AC/DC   For Those About                         Inject The Venom
AC/DC   For Those About                               Snowballed
AC/DC   For Those About                               Evil Walks
AC/DC   For Those About                                   C.O.D.
AC/DC   For Those About                       Breaking The Rules
AC/DC   For Those About                 Night Of The Long Knives
AC/DC   For Those About                               Spellbound
AC/DC   Let There Be Ro                                  Go Down
AC/DC   Let There Be Ro                              Dog Eat Dog
AC/DC   Let There Be Ro                        Let There Be Rock
AC/DC   Let There Be Ro                           Bad Boy Boogie
AC/DC   Let There Be Ro                            Problem Child

In [28]:
cur.close()
conn.close()